Revit 2027 API
FabricationPart.ServiceType Property
 The service type identifier of the fabrication part.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int ServiceType { get; }
Public ReadOnly Property ServiceType As Integer
	Get
public:
property int ServiceType {
	int get ();
}
member ServiceType : int with get
Property Value
Int32
See Also
Reference
FabricationPart Class
Autodesk.Revit.DB Namespace